---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionModifyConnectionParameters
source: html/c71f5fc1-bf3c-397c-9962-162fed95ae8e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralConnectionModifyConnectionParameters Property

"Detailed Parameters"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralConnectionModifyConnectionParameters { get; }
```